//=================================================================================================
//===
//=== io/defines.h
//===
//=== Copyright (c) 2021 by RangeSoft.
//=== All rights reserved.
//===
//=== Litvinov "VeduN" Vitaliy O.
//===
//=================================================================================================
//===
//=== Вспомогательные константы
//===
//=================================================================================================

#pragma once

#include "def.h"

namespace IO
{
const std::string HARWARE_PREFIX = "hardware.";

const std::string VARNAME_OUTTYPE = "outtype";

}

