//=================================================================================================
//===
//=== text_class.h
//===
//=== Copyright (c) 2019 by RangeSoft.
//=== All rights reserved.
//===
//=== Litvinov "VeduN" Vitaliy O.
//===
//=================================================================================================
//===
//=== Синглтон обработки строк
//===
//=================================================================================================

#pragma once

#include "text_class.h"
#include "singlenton.h"


class rTextManager : public rTextClass
{
	SINGLETON(rTextManager);
};



